[
    {
        "id": "common",
        "name": "Common Password: In the top {{ value }} most used passwords",
        "message": "Your password is very commonly used. It would be cracked almost instantly."
    },
    {
        "id": "xkcd",
        "name": "xkcd",
        "message": "I suspect the password crackers might be on to this one by now..."
    },
    {
        "id": "jeff",
        "name": "There's always a back door...",
        "message": "\"The guy who made the software was called Jeff Jeffty Jeff. Born on the first of Jeff, nineteen-jeffty-jeff.\""
    },
    {
        "id": "length.very-short",
        "name": "Length: Very short",
        "message": "Your password is very short. The longer a password is the more secure it will be."
    },
    {
        "id": "possibly-word",
        "name": "Possibly a word",
        "message": "Your password looks like it could be a dictionary word or a name. If it's a name with personal significance it might be easy to guess. If it's a dictionary word it could be cracked very quickly."
    },
    {
        "id": "just.numbers",
        "name": "Character Variety: Just Numbers",
        "message": "Your password only contains numbers. This reduces the number of possible combinations dramatically."
    },
    {
        "id": "just.alphanumeric",
        "name": "Possibly a Word and a Number",
        "message": "Your password looks like it might just be a word and a few digits. This is a very common pattern and would be cracked very quickly."
    },
    {
        "id": "length.short",
        "name": "Length: Short",
        "message": "Your password is quite short. The longer a password is the more secure it will be."
    },
    {
        "id": "just.letters",
        "name": "Character Variety: Just Letters",
        "message": "Your password only contains letters. Adding numbers and symbols can make your password more secure."
    },
    {
        "id": "no.symbols",
        "name": "Character Variety: No Symbols",
        "message": "Your password only contains numbers and letters. Adding a symbol can make your password more secure. Don't forget you can often use spaces in passwords."
    },
    {
        "id": "just.telephone",
        "name": "Possibly a Telephone Number / Date",
        "message": "Your password looks like it might be a telephone number or a date. If it is and it has personal significance then it might be very easy for someone to guess."
    },
    {
        "id": "repeated-pattern",
        "name": "Repeated Pattern",
        "message": "Repeated characters or patterns can make your password more predictable."
    },
    {
        "id": "non-standard-characters",
        "name": "Character Variety: Non-Standard Characters",
        "message": "Your password contains a non-keyboard character. This should make it more secure."
    },
    {
        "id": "length.long",
        "name": "Length: Long",
        "message": "Your password is over sixteen characters long."
    }
]
